In [1]:
import pandas as pd

data = {
    'Category': ['A', 'B', 'A', 'C', 'B', 'A', 'C', 'B'],
    'Value': [10, 25, 12, 30, 28, 15, 33, 22],
    'Group_ID': [1, 2, 1, 3, 2, 1, 3, 2]
}

df = pd.DataFrame(data)
df
# Group by 'Category' and calculate the mean of 'Value'

  Category  Value  Group_ID
0        A     10         1
1        B     25         2
2        A     12         1
3        C     30         3
4        B     28         2
5        A     15         1
6        C     33         3
7        B     22         2

In [3]:
group = df.groupby('Category')['Value'].sum()
group

Category
A    37
B    75
C    63
Name: Value, dtype: int64

In [4]:
group = df.groupby('Group_ID')['Value'].sum()
group

Group_ID
1    37
2    75
3    63
Name: Value, dtype: int64

In [8]:
df['Value'].agg(['sum','mean','max','min','count'])

sum      175.000
mean      21.875
max       33.000
min       10.000
count      8.000
Name: Value, dtype: float64